src/cf/InformationRegisters/ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСФайлами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПеремещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем мПредставлениеПустогоРасписания;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Наименование) Тогда
		
		РасписаниеРегламентногоЗадания = РегистрыСведений.ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.РасписаниеРегламентногоЗаданияПоУмолчанию();
		
	Иначе
		
		РасписаниеРегламентногоЗадания = РегистрыСведений.ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.РасписаниеВыполненияРегламентногоЗадания(Запись.РегламентноеЗаданиеGUID);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мПредставлениеПустогоРасписания = Строка(Новый РасписаниеРегламентногоЗадания);
	
	ОбновитьПредставлениеРасписания();
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (Запись.ДействияСФайлами = 0 ИЛИ Запись.ДействияСФайлами = 3) И НЕ ЗначениеЗаполнено(Запись.КаталогПеремещения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не указан каталог перемещения загруженных файлов!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.ОбновитьДанныеРегламентногоЗадания(Отказ, РасписаниеРегламентногоЗадания, ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//	Обработка выбора каталога хранения архива сохраняемых файлов
	СтандартнаяОбработка   = Ложь;
	ДиалогОткрытияКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияКаталога.ПолноеИмяФайла = "";
	ДиалогОткрытияКаталога.МножественныйВыбор = Ложь;
	
	// Определим, какой каталог выбираем
	ДиалогОткрытияКаталога.Заголовок = "Выберите каталог расположения файлов";
	ДиалогОткрытияКаталога.Каталог   = Запись.Каталог;
	
	// Предоставим выбор пользователю
	Если ДиалогОткрытияКаталога.Выбрать() Тогда
		Запись.Каталог = ДиалогОткрытияКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогПеремещенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//	Обработка выбора каталога хранения архива сохраняемых файлов
	СтандартнаяОбработка   = Ложь;
	ДиалогОткрытияКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияКаталога.ПолноеИмяФайла = "";
	ДиалогОткрытияКаталога.МножественныйВыбор = Ложь;
	
	// Определим, какой каталог выбираем
	ДиалогОткрытияКаталога.Заголовок = "Выберите каталог архива загружаемых файлов";
	ДиалогОткрытияКаталога.Каталог   = Запись.КаталогПеремещения;
	
	// Предоставим выбор пользователю
	Если ДиалогОткрытияКаталога.Выбрать() Тогда
		Запись.КаталогПеремещения = ДиалогОткрытияКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСФайламиПриИзменении(Элемент)
	
	УстановитьДоступностьКаталогПеремещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеПриИзменении(Элемент)
	
	УстановитьДоступностьГиперСсылкиНастройкиРасписания();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗадания(Команда)
	
	РедактироватьРасписанияРегламентногоЗадания();
	
	ОбновитьПредставлениеРасписания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеДиалогом()
	
	УстановитьДоступностьКаталогПеремещения();
	УстановитьДоступностьГиперСсылкиНастройкиРасписания();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКаталогПеремещения()
	
	Элементы.КаталогПеремещения.Доступность = Запись.ДействияСФайлами = 0 ИЛИ Запись.ДействияСФайлами = 3;
	Элементы.КаталогПеремещения.АвтоОтметкаНезаполненного = Запись.ДействияСФайлами = 0 ИЛИ Запись.ДействияСФайлами = 3;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьГиперСсылкиНастройкиРасписания()
	
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Доступность = Запись.ИспользоватьРегламентноеЗадание;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьРасписанияРегламентногоЗадания()
	
	// если расписание не инициализировано в форме на сервере, то создаем новое
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	// открываем диалог для редактирования Расписания
	ОбработчикОповещения = Новый ОписаниеОповещения("РедактированиеРасписанияЗавершение", ЭтотОбъект);
	Диалог.Показать(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеРасписания()
	
	ПредставлениеРасписания = Строка(РасписаниеРегламентногоЗадания);
	
	Если ПредставлениеРасписания = мПредставлениеПустогоРасписания Тогда
		
		ПредставлениеРасписания = НСтр("ru = 'Расписание не задано'");
		
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Заголовок = ПредставлениеРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРасписанияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание <> Неопределено Тогда
		РасписаниеРегламентногоЗадания = Расписание;
		ОбновитьПредставлениеРасписания();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
